src/cf/InformationRegisters/инт_ОчередьВходящихСообщений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>инт_ОчередьВходящихСообщений</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВходящееСообщение</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПотокДанных</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.инт_ПотокиДанных</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ИдентификаторСообщения</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/инт_ТекущийСтатусВходящихСообщений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>инт_ТекущийСтатусВходящихСообщений</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СтатусСообщения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.инт_СтатусыВходящихСообщений</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоПопыток</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекстОшибки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаСледующейПопытки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ИдентификаторСообщения</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/инт_СтатистикаОбработкиСообщений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>инт_СтатистикаОбработкиСообщений</Name>
			<Comment>Регистр для хранения статистики времени обработки сообщений (формирование, отправка, обработка входящих)</Comment>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДлительностьМс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Успешно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ИдентификаторСообщения</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.инт_ТипыОперацийСтатистики</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПотокДанных</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.инт_ПотокиДанных</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подписчик</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.инт_Подписчик</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторОперации</Name>
					<Comment>Отличает записи об операциях, выполненных в пределах одной секунды</Comment>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/инт_ИсторияСтатусовВходящихСообщений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>инт_ИсторияСтатусовВходящихСообщений</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СтатусСообщения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.инт_СтатусыВходящихСообщений</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекстОшибки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ИдентификаторСообщения</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Enums/инт_НаправлениеПотокаДанных.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>инт_НаправлениеПотокаДанных</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Входящий</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Исходящий</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/инт_СтатусыВходящихСообщений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>инт_СтатусыВходящихСообщений</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Новый</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Обработан</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОшибкаОбработки</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Catalogs/инт_ПотокиДанных.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>инт_ПотокиДанных</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НаправлениеПотока</Name>
					<Type>
						<v8:Type>cfg:EnumRef.инт_НаправлениеПотокаДанных</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстОбработчика</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоПопытокОбработки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПаузаМеждуПопыткамиОбработки</Name>
					<Comment>Пауза между попытками обработки в секундах.(0 - сообщение будет обработано повторно как можно быстрее)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалятьОбработанныеСообщенияЧерез</Name>
					<Comment>Количество дней, через которое обработанные сообщения будут удалены(0 - сообщения не удаляются)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валидация</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Активен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пример</Name>
					<Comment>Сериализованное представление примера исходных данных (ЗначениеВСтрокуВнутр)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АсинхроннаяОбработка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СхемаДанных</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.инт_Схемы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяСхемыПакета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкомпилированныйОбработчик</Name>
					<Comment>Скомпилированная внешняя обработка (EPF) из текста обработчика</Comment>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХешСкомпилированногоОбработчика</Name>
					<Comment>Признак версии: хеш текста, из которого получен СкомпилированныйОбработчик</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>32</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтслеживаемыеРеквизиты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПодписчикиПотока</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Подписчик</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.инт_Подписчик</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПодпискиНаВходящиеСообщения</Name>
					<Comment>Источники входящих сообщений (Kafka/RabbitMQ консьюмеры)</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Подписка</Name>
							<Comment>Подписчик Kafka или RabbitMQ</Comment>
							<Type>
								<v8:TypeSet>cfg:DefinedType.инт_Подписка</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/InformationRegisters/инт_ОчередьВходящихСообщений/Ext/ManagerModule.bsl
////////////////////////////////////////////////////////////////////////////////
// инт_ОчередьВходящихСообщений
//  
////////////////////////////////////////////////////////////////////////////////

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Процедура - арегистрировать сообщение
// Фиксирует сообщение в очереди входящих сообщений
// Параметры:
//  ВходящееСообщение           - Соответствие/Структура/строка/число/булево - Десериализованное сообщение
//  ПотокДанных                 - СправочникСсылка.инт_ПотокиДанных   - Ссылка на поток данных
//  ИдентификаторСообщения      - УникальныйИдентфикатор, Неопределено - Уникальный идентификатор сообщения если он есть. Если не заполнен - будет сгенерирован новый.
// 
// Возвращаемое значение:
//  УникальныйИдентификатор - Уникальный идентификатор зарегистрированного входящего сообщения. 
//
Функция ЗарегистрироватьСообщение(ВходящееСообщение, ПотокДанных, ИдентификаторСообщения = Неопределено) Экспорт
    
    Если НЕ ПотокДанных.Активен Тогда
        // Поток не активен. тут нам не жалко, дропаем исключение.
        СообщениеОбОшибке = СтрШаблон("При регистрации сообщения по потоку <%1> произошла ошибка!
        |
        | Информация об ошибке: %2",ПотокДанных.Код, "Поток помечен как не активный!");
        ЗаписьЖурналаРегистрации("ПодсистемаИнтеграции.ОчередьИсходящихСообщений",УровеньЖурналаРегистрации.Ошибка,,ВходящееСообщение,СообщениеОбОшибке);
        ВызватьИсключение СообщениеОбОшибке;
    КонецЕсли;
    Если Не ПотокДанных.НаправлениеПотока = Перечисления.инт_НаправлениеПотокаДанных.Входящий Тогда
        СообщениеОбОшибке = СтрШаблон("При регистрации сообщения по потоку <%1> произошла ошибка!
        |
        | Информация об ошибке: %2",ПотокДанных.Код, "Нельзя регистрировать в очереди входящих сообщений исходящие потоки!");
        ЗаписьЖурналаРегистрации("ПодсистемаИнтеграции.ОчередьИсходящихСообщений",УровеньЖурналаРегистрации.Ошибка,,ВходящееСообщение,СообщениеОбОшибке);
        ВызватьИсключение СообщениеОбОшибке;
    КонецЕсли;
    
    Если ИдентификаторСообщения = Неопределено Тогда
    	 ИдентификаторСообщения = Новый УникальныйИдентификатор;
    КонецЕсли;
     
    НачатьТранзакцию();
    Попытка
        
        Запись = РегистрыСведений.инт_ОчередьВходящихСообщений.СоздатьМенеджерЗаписи();
        Запись.ИдентификаторСообщения = ИдентификаторСообщения;
        Запись.ПотокДанных = ПотокДанных;
        Запись.ВходящееСообщение = Новый ХранилищеЗначения(ВходящееСообщение, Новый СжатиеДанных(9));
        Запись.Записать();
        
        РегистрыСведений.инт_ТекущийСтатусВходящихСообщений.ЗаписатьСтатусСообщения(Запись.ИдентификаторСообщения, Перечисления.инт_СтатусыВходящихСообщений.Новый);
        ЗафиксироватьТранзакцию();
    Исключение
        ОтменитьТранзакцию();
        СообщениеОбОшибке = СтрШаблон("При регистрации входящего сообщения по потоку <%1> произошла ошибка!
        |
        | Информация об ошибке: %2",ПотокДанных.ИдентификаторПотока, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
        ЗаписьЖурналаРегистрации("ПодсистемаИнтеграции.ОчередьИсходящихСообщений",УровеньЖурналаРегистрации.Ошибка,,ВходящееСообщение,СообщениеОбОшибке);
        ВызватьИсключение СообщениеОбОшибке;
    КонецПопытки;
    
    Возврат ИдентификаторСообщения;
КонецФункции

// Процедура - Удалить сообщение из очереди
// Удаляет сообщение из очереди. Удаляет все записи в связанных регистрах(Статус, историяСтатусов)
// Параметры:
//  ИдентификаторСообщения     -  УникальныйИдентификатор    - УникальныйИдентификатор сообщения удаляемого из очереди
//
Процедура УдалитьСообщениеИзОчереди(ИдентификаторСообщения) Экспорт
		
КонецПроцедуры

// Процедура - Обработать сообщение по идентификатору
// Обрабатывает сообщение по идентификатору.
//
// Параметры:
//  ИдентификаторСообщения     -   УникальныйИдентификатор   - Идентификатор сообщения которое требуется сформировать.
//
Процедура ОбработатьСообщениеПоИдентификатору(ИдентификаторСообщения) Экспорт
    СообщениеВОчереди = ПолучитьДанныеОчередиПоИдентификатору(ИдентификаторСообщения, "ВходящееСообщение,ПотокДанных");
    
    ВремяНачала = ТекущаяУниверсальнаяДатаВМиллисекундах();
    
    // Обработчик потока выполняется вне транзакции: его защитная транзакция должна быть
    // верхнего уровня, иначе оставленные обработчиком транзакции снять невозможно.
    // Плата за это: изменения обработчика уже зафиксированы, сбой записи статуса их не откатит,
    // и при повторной обработке сообщения они будут применены ещё раз.
    Попытка
        Справочники.инт_ПотокиДанных.ОбработатьВходящееСообщениеПоПотоку(СообщениеВОчереди.ВходящееСообщение, СообщениеВОчереди.ПотокДанных);
    Исключение
        ЗафиксироватьОшибкуОбработки(ИдентификаторСообщения, СообщениеВОчереди.ПотокДанных,
            ВремяНачала, ИнформацияОбОшибке());
        Возврат;
    КонецПопытки;
    
    НачатьТранзакцию();
    Попытка
        РегистрыСведений.инт_ТекущийСтатусВходящихСообщений.ЗаписатьСтатусСообщения(ИдентификаторСообщения, Перечисления.инт_СтатусыВходящихСообщений.Обработан);
        ЗафиксироватьТранзакцию();
    Исключение
        ОтменитьТранзакцию();
        ЗафиксироватьОшибкуОбработки(ИдентификаторСообщения, СообщениеВОчереди.ПотокДанных,
            ВремяНачала, ИнформацияОбОшибке());
        Возврат;
    КонецПопытки;
    
    ДлительностьМс = ТекущаяУниверсальнаяДатаВМиллисекундах() - ВремяНачала;
    РегистрыСведений.инт_СтатистикаОбработкиСообщений.ЗаписатьСтатистикуОбработкиВходящего(
        ИдентификаторСообщения, СообщениеВОчереди.ПотокДанных, ДлительностьМс, Истина);
КонецПроцедуры

// Функция - Получить данные очереди по идентификатору
//
// Параметры:
//  ИдентификаторСообщения     -  УникальныйИдентификатор  -  Идентификатор сообщения по которому будут получены данные
//  СписокПолей                 - Строка                    - Строка содержащая перечисления полей перечисленных через запятую.
// 
// Возвращаемое значение:
//  Структура - Структура данных сообщения. См. функцию ПолучитьШаблонСтруктурыСообщенияОчереди
//
Функция ПолучитьДанныеОчередиПоИдентификатору(ИдентификаторСообщения, СписокПолей) Экспорт
	СтруктураСообщения = Новый Структура;
    
    МассивПолей = СтрРазделить(СписокПолей, ",",Ложь);
    Если МассивПолей.Количество() = 0 Тогда
    	ВызватьИсключение "Список полей - не может быть пустым!";
    КонецЕсли;

    ШаблонПоля = "    инт_ОчередьВходящихСообщений.%1 КАК %1";
    ТекстВыборка = "";
    ЭтоПервоеПоле = Истина;
    Для Каждого Поле Из МассивПолей Цикл
        ТекстВыборка = ТекстВыборка +?(ЭтоПервоеПоле,"",",")+Символы.ПС+ СтрШаблон(ШаблонПоля, СокрЛП(Поле));
        ЭтоПервоеПоле = Ложь;
    КонецЦикла;
    
    Запрос = Новый Запрос;
    Запрос.Текст = СтрШаблон("ВЫБРАТЬ
                   |    %1
                   |ИЗ
                   |    РегистрСведений.инт_ОчередьВходящихСообщений КАК инт_ОчередьВходящихСообщений
                   |ГДЕ
                   |    инт_ОчередьВходящихСообщений.ИдентификаторСообщения = &ИдентификаторСообщения", ТекстВыборка);
    Запрос.УстановитьПараметр("ИдентификаторСообщения",ИдентификаторСообщения);
    Выборка = Запрос.Выполнить().Выбрать();
    Если выборка.Следующий() Тогда
            
        Для Каждого Поле Из МассивПолей Цикл
           	    СтруктураСообщения.Вставить(СокрЛП(Поле),?(СокрЛП(Поле)="ВходящееСообщение",Выборка[СокрЛП(Поле)].Получить(),Выборка[СокрЛП(Поле)]));
        КонецЦикла;
    КонецЕсли;
    Возврат СтруктураСообщения;
КонецФункции

// Процедура - Удалить сообщение из очереди по идентификатору
// Удаляет из очереди сообщение, а так же всю связанную с ним информацию из смежных регистров.
// Параметры:
//  ИдентификаторСообщения	 - УникальныйИдентификатор	- Уникальный идентификатор сообщения. 
//
Процедура УдалитьСообщениеИзОчередиПоИдентификатору(ИдентификаторСообщения) Экспорт

	НачатьТранзакцию();
	Попытка
		РегистрыСведений.инт_ТекущийСтатусВходящихСообщений.УдалитьЗаписьПоИдентификатору(ИдентификаторСообщения);
		РегистрыСведений.инт_ИсторияСтатусовВходящихСообщений.ОчиститьИсториюПоИдентификатору(ИдентификаторСообщения);
		
		Запись = РегистрыСведений.инт_ОчередьВходящихСообщений.СоздатьМенеджерЗаписи();
		Запись.ИдентификаторСообщения = ИдентификаторСообщения;
		Запись.Удалить();
		
		ЗафиксироватьТранзакцию();
	Исключение
	    ОтменитьТранзакцию();
		
		СообщениеОбОшибке = СтрШаблон("При попытке удаления информации о сообщении с идентификатором <%1> возникла ошибка!
		|
		|ИнформацияОбОшибке: %2",
		ИдентификаторСообщения,
		ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		
		ЗаписьЖурналаРегистрации("ПодсистемаИнтеграции.ОчередьВходящихСообщений", УровеньЖурналаРегистрации.Ошибка,,,СообщениеОбОшибке);
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Процедура - Зафиксировать ошибку обработки
// Записывает статистику неуспешной обработки, статус ошибки и сообщение в журнал регистрации.
//
// Параметры:
//  ИдентификаторСообщения - УникальныйИдентификатор - Идентификатор обрабатываемого сообщения.
//  ПотокДанных            - СправочникСсылка.инт_ПотокиДанных - Поток данных сообщения.
//  ВремяНачала            - Число - Универсальная дата в миллисекундах на начало обработки.
//  ОшибкаОбработки        - ИнформацияОбОшибке - Возникшая ошибка.
//
Процедура ЗафиксироватьОшибкуОбработки(ИдентификаторСообщения, ПотокДанных, ВремяНачала, ОшибкаОбработки)

    ОписаниеОшибки = ПодробноеПредставлениеОшибки(ОшибкаОбработки);
    ДлительностьМс = ТекущаяУниверсальнаяДатаВМиллисекундах() - ВремяНачала;

    РегистрыСведений.инт_СтатистикаОбработкиСообщений.ЗаписатьСтатистикуОбработкиВходящего(
        ИдентификаторСообщения, ПотокДанных, ДлительностьМс, Ложь);

    РегистрыСведений.инт_ТекущийСтатусВходящихСообщений.ЗаписатьСтатусСообщения(
        ИдентификаторСообщения, Перечисления.инт_СтатусыВходящихСообщений.ОшибкаОбработки, ОписаниеОшибки);

    СообщениеОбОшибке = СтрШаблон("При попытке обработать сообщение с идентификатором <%1> возникла ошибка.
    |
    |Информация об ошибке: %2", ИдентификаторСообщения, ОписаниеОшибки);
    ЗаписьЖурналаРегистрации("ПодсистемаИнтеграции.МенеджерПотоковОбработкиВходящихСообщений",
        УровеньЖурналаРегистрации.Ошибка,,,СообщениеОбОшибке);

КонецПроцедуры

#КонецОбласти

#КонецЕсли
